# FailedConvertWallToPanel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..FailedConvertWallToPanel Property
BuiltInFailures..::..WallFailures Class See Also
---
Unable to convert wall to panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedConvertWallToPanel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedConvertWallToPanel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedConvertWallToPanel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace